Source/app/controllers/authors/accounts_controller.rb

UPDATE "authors" SET "name" = ?, "email" = ?, "bio" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["name", "Dmitry Shaido"], ["email", "d.shaido@gmail.com"], ["bio", "making tritpo cours of bsuir"], ["updated_at", "2017-12-04 14:15:39.846305"], ["id", 1]]
---
    def update_info
      if current_author.update(author_info_params)