Source/app/views/blog/posts/_post.html.erb

SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('the best post'))
---
      <h4 class="card-title"><%= link_to post.title, post %></h4>
      <p><%= raw post.tags.map { |t| link_to t.name, posts_path(tag: t.name)}.join(', ') %></p>